(function () {

    "use strict";

    window.hh = {};

    hh.getCulture = function () {
        return "ru";
    };

    hh.gui = {};
    hh.model = {};
    hh.store = {};
    hh.util = {};
    hh.page = {};

    hh.TEXT = {
        ru: {
            dayOfWeek: ["Понедельник", "Вторник", "Среда", "Четверг", "Пятница", "Суббота", "Воскресенье"],
            month: ["Январь", "Ферваль", "Март", "Апрель", "Май", "Июнь", "Июль", "Август", "Сентябрь", "Октябрь", "Ноябрь", "Декабрь"],
            monthsGenitive: ["января", "февраля", "марта", "апреля", "мая", "июня", "июля", "августа", "сентября", "октября", "ноября", "декабря"]
        }
    };



}());